#### BuiltInFailures.FloorFailures Members

---

|  |
| --- |
| BuiltInFailures FloorFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures FloorFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | FloorSlopeExceedsThreshold | Thickness of this Floor may be slightly inaccurate due to extreme Shape Editing. Dimensions to this element in sections and details may not accurately indicate the Thickness shown in Type Properties. |

# See Also

BuiltInFailures FloorFailures Class

Autodesk.Revit.DB Namespace